<?php
    $starr = ["นายชยางกูร ขำเถื่อน", "นายไชยวัฒน์ มิตรานนท์", "นายวโรดม กุนเรือง", "นายอภิวิชญ์ ชนะชล", 
        "นายชานนท์ ชาวชายโขง", "นายนพดล ละดาดก", "นายชินกฤช ธนกรณ์กุล", "นายพงศ์ภรณ์ สุนทรานุรักษ์", 
        "นายพรเทพ เอมอมร", "นายวรชัย เจนจบวิทยา", "นายสรวิชญ์ สิทธิบวรสกุล", "นายไชยวัฒน์ จัดเจนนาวี",
        "นายวงศ์วริศ ชัยกุลประดิษฐ์", "นายคณิศร ศักดิ์ทอง", "นายธนวัฒน์ ลบช้าง", "นายแทนไท จันทร์ขจร", 
        "นายปรัญชัย เพชรแสงโรจน์", "นายพัทธดนย์ สุวรรณรัตน์", "นายสัณหณัฐ ครองธรรมศิริ", "นายจิรภัทร ภูบรรทัด", 
        "นายจิรานุวัฒน์ ขันธ์นิตย์", "นายสิปปกร จันทร์พุ่ม", "นายอชิรวัตติ์ ศรีรัตนาม", "นายปณิทัศน์ แซ่เจียม",
        "นายกันตพัฒน์ โตใหญ่", "นายชุติเดช เทิดสถิตบุญฤทธิ์", "นายวชิรวิชญ์ ตะเภาทอง", "นายพุฒิเกียรติ แก้วกล้า", 
        "นายศุภโชค ปิยเจริญสิทธิ์", "นางสาวสุภาวิตา บุญโภคอุดม", "นางสาวพิมพ์ชนก สุขนุ่ม", "นางสาววรณัน บุหงาเกษมสุข", 
        "นางสาวอภิชญา ตะโกจีน", "นางสาวนัทธมน วชิรสุดเลขา", "นางสาวสิรินดา อยู่เมฆ", "นางสาวปภาดา เหลืองประภา",
        "นางสาวณัฐชา เท้าสมบุญ", "นางสาวธัญชนก สุดธง", "นางสาวกัญญวรา สายโส", "นางสาวนภัสสร กิจจารักษ์"];
    $total = count($starr);
?>
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Documents</title>
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-QWTKZyjpPEjISv5WaRU9OFeRpok6YctnYmDr5pNlyT2bRjXh0JMhjY6hW+ALEwIH" crossorigin="anonymous">
</head>
<body>
    <div class="container text-center">
        <h1>1. ให้นักเรียนเขียนคำสั่งภาษา PHP ชื่อนักเรียนลงในตารางตามรูปแบบ</h1>
        <p>สามารถเปิดหาข้อมูลจาก internet ได้ สามารถใช้ framework ในการสร้าง Table ได้</p>
        <table class="table table-group-divider">
    <thead>
        <tr>
            <th>No.</th>
            <th>ชื่อ - นามสกุล</th>
            <th>ห้อง</th>
        </tr>
    </thead>
    <tbody>
        <?php for ($x=1;$x<=10;$x++) {?>
                <tr>
                    <td><?php echo $x?></td>
                    <td><?php echo $starr[23]?></td>
                    <td>ม.6/10</td>
                </tr>
                <?php } ?>
    </tbody>
    </table>
    <h1>2.ให้นักเรียนเขียนคำสั่งภาษา PHP นับจำนวนข้อมูลใน Array โดยข้อมูลที่กำหนดให้ ข้อมูลที่กำหนด ให้ ['รายชื่อนักเรียน ม.6/10' คำตอบ คือ 40 คน</h1>
    <p>สามารถเปิดหาข้อมูลจาก internet ได้</p>
    <b><p>นักเรียนทั้งหมด <?php echo $total;?> คน</p></b>
    </div>
</body>
</html>
